clc; clear; close all;

%% ================================
% 1. إعدادات النظام (System Setup)
% ================================

n = 10000;                % عدد البتات المرسلة
p_source = 0.8;           % احتمال إرسال 1 (source biased)
p_error_range = 0:0.02:0.5; % مدى ضجيج القناة (p في BSC)
BER = zeros(1,length(p_error_range));

%% ==========================================
% 2. توليد الإشارة مرة واحدة (Source Signal)
% ==========================================
% لماذا مرة واحدة؟
% لأننا نريد نفس الرسالة ونغير فقط القناة (p)

x = rand(1,n) < p_source; 
print=x(1:10);
fprintf('firest teen bits generation \n');
disp(print);
% تفسير:
% إذا rand < 0.8 → نرسل 1
% إذا لا → نرسل 0

%% ================================
% 3. حلقة تغيير القناة فقط
% ================================
for k = 1:length(p_error_range)

    p = p_error_range(k);  % احتمال الخطأ في القناة

    %% ================================
    % 4. نموذج القناة BSC
    % ================================
    % القناة تقلب البتات باحتمال p

    noise = rand(1,n) < p;  
    % noise = 1 يعني "قلب البت"

    y = xor(x, noise);      
    % XOR:
    % 0 ⊕ 1 = 1 (قلب)
    % 1 ⊕ 1 = 0 (قلب)
    % 1 ⊕ 0 = 1 (بدون تغيير)

    %% ==========================================
    % 5. كاشف MAP (الفكرة الأساسية في المشروع)
    % ==========================================
    % MAP: نختار X الذي يعطي أكبر احتمال:
    % P(X|Y) ∝ P(Y|X) * P(X)

    % =========================
    % حسابات الاحتمالات
    % =========================

    % إذا Y=1:
    P1 = (1-p) * p_source;      % احتمال: X=1 وأرسل صحيح
    P0 = p * (1-p_source);      % احتمال: X=0 وانقلب إلى 1

    % إذا Y=0:
    Q1 = p * p_source;          % X=1 وانقلب إلى 0
    Q0 = (1-p) * (1-p_source);  % X=0 وبقي 0

    %% =========================
    % 6. اتخاذ القرار MAP
    % =========================

    x_hat = zeros(1,n);

    idx1 = (y == 1);  % مواقع المستقبل = 1
    idx0 = (y == 0);  % مواقع المستقبل = 0

    % القرار عندما Y=1:
    % نقارن بين:
    % (X=1 صحيح) vs (X=0 خطأ)
    x_hat(idx1) = P1 >= P0;

    % القرار عندما Y=0:
    x_hat(idx0) = Q1 >= Q0;

    %% =========================
    % 7. حساب BER
    % =========================
    % BER = عدد الأخطاء / عدد البتات

    BER(k) = mean(x ~= x_hat);

end
print_2=noise(1:10);
fprintf('firest teen bits of noise generation \n');
disp(print_2);
print_3=y(1:10);
fprintf('firest teen bits after add noise\n');
disp(print_3);
%% ================================
% 8. رسم النتائج
% ================================

figure('Color','w');
plot(p_error_range, BER,'b-o','LineWidth',1.5);
grid on;

xlabel('احتمال خطأ القناة p');
ylabel('BER (نسبة خطأ البت)');
title('أداء MAP Detector على قناة BSC');

%% ================================
% 9. ملاحظة تعليمية مهمة
% ================================
disp('MAP يستخدم معلومات القناة + احتمالية المصدر، لذلك أداؤه أفضل من ML');